# ============================================================
# 🍺 Brewfile – Mustafa's macOS Setup
# Updated: 2026-05-10
# Usage: brew bundle install --file=~/.dotfiles/Brewfile
# ============================================================

# --------------------------------------------------
# 📌 Taps
# --------------------------------------------------
tap "cloudflare/cloudflare"
tap "anomalyco/tap"
tap "majd/repo"
tap "pluk-inc/tap"
tap "tw93/tap"

# --------------------------------------------------
# 🛠️ CLI Tools (Formulae)
# --------------------------------------------------
brew "bat"
brew "bind"
brew "cloudflared"
brew "direnv"
brew "ente-cli"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "htop"
brew "ipatool"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "librsvg"
brew "llvm"
brew "mas"
brew "mlx"
brew "mlx-c"
brew "mplayer"
brew "node"
brew "ollama"
brew "openconnect"
brew "openssl@3"
brew "pandoc"
brew "pipx"
brew "postgresql@16", restart_service: :changed
brew "pv"
brew "pyenv"
brew "python@3.11"
brew "python@3.14"
brew "ripgrep"
brew "sstp-client"
brew "starship"
brew "stoken"
brew "tesseract"
brew "tldr"
brew "tree"
brew "wgcf"
brew "yazi"
brew "zoxide"
brew "zpaq"
brew "zsh-autocomplete"
brew "anomalyco/tap/opencode"

# --------------------------------------------------
# 🔤 Fonts
# --------------------------------------------------
cask "font-vazirmatn"
cask "font-noto-naskh-arabic"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# --------------------------------------------------
# 🌐 Browsers
# --------------------------------------------------
cask "microsoft-edge"
cask "google-chrome"
cask "firefox"
cask "zen"

# --------------------------------------------------
# 💬 Communication
# --------------------------------------------------
cask "whatsapp"
cask "discord"

# --------------------------------------------------
# 🛠️ Development – IDEs & Editors
# --------------------------------------------------
cask "visual-studio-code"
cask "cursor"
cask "ghostty"
cask "iterm2"
cask "wezterm"
cask "warp"
cask "termius"
cask "postman"
cask "dbeaver-community"

# --------------------------------------------------
# 🎬 Media & Creative
# --------------------------------------------------
cask "obs"
cask "audacity"
cask "handbrake-app"
cask "losslesscut"
cask "iina"
cask "krita"
cask "mediainfo"
cask "jubler"

# --------------------------------------------------
# 📦 Utilities
# --------------------------------------------------
cask "raycast"
cask "appcleaner"
cask "keka"
cask "free-download-manager"
cask "motrix"
cask "progressive-downloader"
cask "maccy"
cask "steermouse"
cask "keyboardcleantool"
cask "leader-key"
cask "keyboard-cowboy"
cask "logi-options+"
cask "meetingbar"
cask "swiftbar"
cask "osaurus"
cask "android-platform-tools"
cask "basictex"
cask "gcloud-cli"
cask "kakuku"
cask "markdown-preview"
cask "microsoft-auto-update"
cask "opencode-desktop"
cask "powershell"

# --------------------------------------------------
# 🌐 VPN & Network
# --------------------------------------------------
cask "outline"

# --------------------------------------------------
# 🖥️ Remote & Virtualization
# --------------------------------------------------
cask "anydesk"
cask "teamviewer"
cask "vmware-fusion"
cask "omnissa-horizon-client"
cask "virtualbuddy"
cask "whisky"
cask "winbox"
cask "orbstack"

# --------------------------------------------------
# 💼 Office & Productivity
# --------------------------------------------------
cask "microsoft-outlook"
cask "cisco-jabber"

# --------------------------------------------------
# 🧰 Automation
# --------------------------------------------------
cask "hammerspoon"

# --------------------------------------------------
# 🍎 Mac App Store
# --------------------------------------------------
mas "Bitwarden", id: 1352778147
mas "Microsoft To Do", id: 1274495053
mas "CotEditor", id: 1024640650
mas "Xcode", id: 497799835
mas "Windows App", id: 1295203466

# --------------------------------------------------
# 🆚 VS Code Extensions
# --------------------------------------------------
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
